app/controllers/clients_controller.rb

INSERT INTO "clients" ("clientName", "created_at", "updated_at") VALUES (?, ?, ?)  [["clientName", "Jo-Ann"], ["created_at", Mon, 16 Sep 2013 23:16:39 UTC +00:00], ["updated_at", Mon, 16 Sep 2013 23:16:39 UTC +00:00]]
---
  def create
    @client = Client.new(params[:client])
    if @client.save

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @client = Client.find(params[:id])

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 1]]
---
  def destroy
    @client = Client.find(params[:id])
    @client.destroy